app/controllers/captcha_tests_controller.rb

SELECT * FROM `captcha_tests`
---
  def index
    @captcha_tests = CaptchaTest.all

SELECT * FROM `captcha_tests` WHERE (`captcha_tests`.`id` = 1)
---
  def show
    @captcha_test = CaptchaTest.find(params[:id])

SELECT * FROM `captcha_tests` WHERE (`captcha_tests`.`id` = 1)
---
  def edit
    @captcha_test = CaptchaTest.find(params[:id])

INSERT INTO `captcha_tests` (`name`, `created_at`, `updated_at`) VALUES('', '2010-04-19 14:47:16', '2010-04-19 14:47:16')
---
  def create
    @captcha_test = CaptchaTest.new(params[:captcha_test])

    respond_to do |format|
      if @captcha_test.save

SELECT * FROM `captcha_tests` WHERE (`captcha_tests`.`id` = 1)
DELETE FROM `captcha_tests` WHERE `id` = 1
---
  def destroy
    @captcha_test = CaptchaTest.find(params[:id])
    @captcha_test.destroy