app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts`

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def create
    @post = Post.new(params[:post])
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `updated_at`, `date`, `user_id`, `visible`) VALUES('2010-04-20 19:45:06', 'Тестовый заголовок', 'Тестовое тело поста', '2010-04-20 19:45:06', '2010-04-20 23:44:00', NULL, 0)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `updated_at` = '2010-04-20 19:47:03', `user_id` = 1 WHERE `id` = 1

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
DELETE FROM `posts` WHERE `id` = 3