app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "perishable_token", "password_salt", "persistence_token", "login", "email", "active") VALUES('2010-04-14 16:26:58', '4d8c170bdc817ccf4e5286a5c32122ecc25a47de5262024eea3649b0eb76e0f2fcddfcfba55174134b50c065982b83ec133491125724c6822a9c681d251dfdf7', '2010-04-14 16:26:58', 'oTloFisZwt0SBKECx_-t', '6YVb_qRSImDipVJroUWZ', '71dfc08111ace453aed38b1fc3c3453a199c684c56a83c2c1569439c52b06497a2a89adb0750600659a770590c5e24f450851605c6a1641df693a8eccbadec78', 'woto', 'oganer@gmail.com', 'f')
---
  def create
    @user = User.new(params[:user])
    if @user.save